Extensions/FortMonitorAPI_ТЛЭ/Catalogs/SDL_НастройкиФортМонитор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>SDL_НастройкиФортМонитор</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФортМонитор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатУчетныеЗаписиСистемыМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалЗагрузки</Name>
					<Comment>Загрузка данных регламентным заданием за указанное время (хранится в сек.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьПробегРасход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьДопСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьКоординаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SDL_ЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ЧасовойПоясБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SDL_ЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_РаботаСHTTPСервисами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ПересчетОдометраПоПробегуНаВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ИспользоватьУниверсальноеВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ПересчетПробегаПоОдометруНаВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/FortMonitorAPI_ТЛЭ/Catalogs/SDL_НастройкиФортМонитор/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ИдентификаторДействия = "Справочник.SDL_НастройкиФортМонитор.ПроверитьПодключение";
	уатРаботаСРасширениямиКлиент.ПСМ_ВыполнитьДействияВФорме(ИдентификаторДействия, 
			уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.СистемаМониторинга, "НаименованиеПС"),
			Объект.УчетнаяЗапись,
			ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалЗагрузкиПредставлениеПриИзменении(Элемент)
	
	Объект.ИнтервалЗагрузки = Число(ИнтервалЗагрузкиПредставление);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокИнтервалов = Элементы.ИнтервалЗагрузкиПредставление.СписокВыбора;
//	ИнтервалЗагрузкиПредставление = СписокИнтервалов.НайтиПоЗначению(Формат(Объект.ИнтервалЗагрузки, "ЧГ=0"));
	ИнтервалЗагрузкиПредставление = Формат(Объект.ИнтервалЗагрузки, "ЧГ=0");
	
КонецПроцедуры

&НаКлиенте
Процедура SDL_ПересчетОдометраПоПробегуНаВозвратПриИзменении(Элемент)
	
	Если Объект.SDL_ПересчетОдометраПоПробегуНаВозврат И Объект.SDL_ПересчетПробегаПоОдометруНаВозврат Тогда
		 Объект.SDL_ПересчетПробегаПоОдометруНаВозврат = Ложь;
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура SDL_ПересчетПробегаПоОдометруНаВозвратПриИзменении(Элемент)

	Если Объект.SDL_ПересчетПробегаПоОдометруНаВозврат И  Объект.SDL_ПересчетОдометраПоПробегуНаВозврат Тогда
	   Объект.SDL_ПересчетОдометраПоПробегуНаВозврат = Ложь;
   КонецЕсли;
   
КонецПроцедуры
